# Pandas Practice Notebook
Learning Pandas for Data Analytics

In [2]:
import pandas as pd
import numpy as np

In [4]:
data = {
    "Name": ["Rahul", "Aman", "Neha", "Priya"],
    "Marks": [85, 72, 90, 60],
    "Passed": [True, True, True, False]
}

df = pd.DataFrame(data)
df

    Name  Marks  Passed
0  Rahul     85    True
1   Aman     72    True
2   Neha     90    True
3  Priya     60   False

In [6]:
df.head()
df.info()
df.describe()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Marks   4 non-null      int64
 2   Passed  4 non-null      bool
dtypes: bool(1), int64(1), object(1)
memory usage: 200.0+ bytes

       Marks
count   4.00
mean   76.75
std    13.50
min    60.00
25%    69.00
50%    78.50
75%    86.25
max    90.00

In [8]:
df[df["Marks"] > 80]

    Name  Marks  Passed
0  Rahul     85    True
2   Neha     90    True

In [10]:
import pandas as pd

data = {
    "Name": ["Rahul", "Aman", "Neha", "Priya", "Rohit", "Sneha"],
    "Class": ["A", "A", "B", "B", "A", "B"],
    "Marks": [85, 78, 90, 60, 88, 72]
}

df = pd.DataFrame(data)
df

    Name Class  Marks
0  Rahul     A     85
1   Aman     A     78
2   Neha     B     90
3  Priya     B     60
4  Rohit     A     88
5  Sneha     B     72

In [12]:
df.groupby("Class")["Marks"].mean()

Class
A    83.666667
B    74.000000
Name: Marks, dtype: float64

In [14]:
df.groupby("Class")["Marks"].sum()

Class
A    251
B    222
Name: Marks, dtype: int64

In [16]:
df.groupby("Class")["Name"].count()

Class
A    3
B    3
Name: Name, dtype: int64

In [18]:
df.groupby("Class")["Marks"].agg(["mean", "max", "min"])

            mean  max  min
Class
A      83.666667   88   78
B      74.000000   90   60

In [20]:
df.groupby("Class")["Marks"].max()

Class
A    88
B    90
Name: Marks, dtype: int64

Example Dataset (WITH Missing Values)

In [23]:
import pandas as pd
import numpy as np

data = {
    "Name": ["Rahul", "Aman", "Neha", "Priya", "Rohit"],
    "Marks": [85, np.nan, 90, 60, np.nan],
    "Class": ["A", "A", "B", "B", "A"]
}

df = pd.DataFrame(data)
df

    Name  Marks Class
0  Rahul   85.0     A
1   Aman    NaN     A
2   Neha   90.0     B
3  Priya   60.0     B
4  Rohit    NaN     A

In [25]:
df.isnull()

    Name  Marks  Class
0  False  False  False
1  False   True  False
2  False  False  False
3  False  False  False
4  False   True  False

In [27]:
df.isnull().sum()

Name     0
Marks    2
Class    0
dtype: int64

In [38]:

df.fillna(method="ffill")

C:\Users\tadas\AppData\Local\Temp\ipykernel_32984\3457596208.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method="ffill")

    Name      Marks Class
0  Rahul  85.000000     A
1   Aman  78.333333     A
2   Neha  90.000000     B
3  Priya  60.000000     B
4  Rohit  78.333333     A

In [40]:
df.groupby("Class")["Marks"].mean()

Class
A    80.555556
B    75.000000
Name: Marks, dtype: float64

sorting

In [43]:
df

    Name      Marks Class
0  Rahul  85.000000     A
1   Aman  78.333333     A
2   Neha  90.000000     B
3  Priya  60.000000     B
4  Rohit  78.333333     A

In [45]:
df.sort_values(by="Marks")

    Name      Marks Class
3  Priya  60.000000     B
1   Aman  78.333333     A
4  Rohit  78.333333     A
0  Rahul  85.000000     A
2   Neha  90.000000     B

In [47]:
df.sort_values(by="Marks", ascending=False)

    Name      Marks Class
2   Neha  90.000000     B
0  Rahul  85.000000     A
1   Aman  78.333333     A
4  Rohit  78.333333     A
3  Priya  60.000000     B

In [49]:
df.sort_values(by=["Class", "Marks"], ascending=[True, False])

    Name      Marks Class
0  Rahul  85.000000     A
1   Aman  78.333333     A
4  Rohit  78.333333     A
2   Neha  90.000000     B
3  Priya  60.000000     B

In [51]:
df.sort_values(by="Marks", ascending=False, inplace=True)

In [53]:
df.reset_index(drop=True, inplace=True)
df

    Name      Marks Class
0   Neha  90.000000     B
1  Rahul  85.000000     A
2   Aman  78.333333     A
3  Rohit  78.333333     A
4  Priya  60.000000     B

In [55]:
df.sort_values(by="Marks").head(3)

    Name      Marks Class
4  Priya  60.000000     B
2   Aman  78.333333     A
3  Rohit  78.333333     A